InformationRegisters/бит_НастройкаСоответствияЦелевогоФинансирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкаСоответствияЦелевогоФинансирования</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетЦелевогоФинансирования</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НазначениеЦелевыхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначениеЦелевыхСредств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/бит_ЗакрытиеМесяца/Ext/Module.bsl
#Область ПроцедурыИФункцииРаботыСоСчетамиИСубконто

Функция ПодготовитьТаблицыЗакрытиеСчета20(ТаблицаРеквизиты, Отказ, ТекстОшибки = "") Экспорт
	
	ТаблицаПроводок = ПолучитьТаблицаЗакрытияСчета20();
	Реквизиты       = ТаблицаРеквизиты[0];
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация", Реквизиты.Организация);
	
	ВидыСубконто   = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
	
	Запрос.УстановитьПараметр("ВидыСубконто"  , ВидыСубконто);
	Запрос.УстановитьПараметр("Счет"          , ПланыСчетов.Хозрасчетный.ОсновноеПроизводство);
	Запрос.УстановитьПараметр("НачалоПериода" , Реквизиты.НачДата);
	Запрос.УстановитьПараметр("КонецПериода"  , Новый Граница(Реквизиты.КонДата, ВидГраницы.Включая));
	
	Запрос.Текст =
		
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХозрасчетныйОбороты.Подразделение,
	|	ХозрасчетныйОбороты.Счет КАК СчетОП,
	|	бит_НастройкаСоответствияЦелевогоФинансированияСрезПоследних.СчетЦелевогоФинансирования КАК СчетЦФ,
	|	ХозрасчетныйОбороты.Субконто1 КАК НоменклатурнаяГруппа,
	|	ХозрасчетныйОбороты.Субконто2 КАК СтатьяЗатрат,
	|	бит_НастройкаСоответствияЦелевогоФинансированияСрезПоследних.НазначениеЦелевыхСредств,
	|	ХозрасчетныйОбороты.СуммаОборот КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет = &Счет, &ВидыСубконто, Организация = &Организация, , ) КАК ХозрасчетныйОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_НастройкаСоответствияЦелевогоФинансирования.СрезПоследних(&КонецПериода, ) КАК бит_НастройкаСоответствияЦелевогоФинансированияСрезПоследних
	|		ПО ХозрасчетныйОбороты.Организация = бит_НастройкаСоответствияЦелевогоФинансированияСрезПоследних.Организация
	|			И ХозрасчетныйОбороты.Субконто1 = бит_НастройкаСоответствияЦелевогоФинансированияСрезПоследних.НоменклатурнаяГруппа";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаПроводок.Добавить();
		
		Если Выборка.Сумма < 0 Тогда
			
			НоваяСтрока.СчетДт          = Выборка.СчетОП;
			НоваяСтрока.СубконтоДт1     = Выборка.НоменклатурнаяГруппа;
			НоваяСтрока.СубконтоДт2     = Выборка.СтатьяЗатрат;
			НоваяСтрока.СчетКт          = Выборка.СчетЦФ;
			НоваяСтрока.СубконтоКт1     = Выборка.НазначениеЦелевыхСредств;
			НоваяСтрока.Сумма           = Выборка.Сумма * -1;
			НоваяСтрока.ПодразделениеДт = Выборка.Подразделение;
			
		Иначе
			
			НоваяСтрока.СчетДт          = Выборка.СчетЦФ;
			НоваяСтрока.СубконтоДт1     = Выборка.НазначениеЦелевыхСредств;
			НоваяСтрока.СчетКт          = Выборка.СчетОП;
			НоваяСтрока.СубконтоКт1     = Выборка.НоменклатурнаяГруппа;
			НоваяСтрока.СубконтоКт2     = Выборка.СтатьяЗатрат;
			НоваяСтрока.Сумма           = Выборка.Сумма;
			НоваяСтрока.ПодразделениеКт = Выборка.Подразделение;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат ТаблицаПроводок;
	
КонецФункции

Функция ПолучитьТаблицаЗакрытияСчета20()
	
	ОписаниеТипаЧисла15_2 = ОбщегоНазначения.ОписаниеТипаЧисло(15, 2);
	ОписаниеТипаСчетХозр  = Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный");
	
	ТаблицаЗакрытияСчета20 = Новый ТаблицаЗначений;
	ТаблицаЗакрытияСчета20.Колонки.Добавить("СчетДт"         , ОписаниеТипаСчетХозр);
	ТаблицаЗакрытияСчета20.Колонки.Добавить("СчетКт"         , ОписаниеТипаСчетХозр);
	ТаблицаЗакрытияСчета20.Колонки.Добавить("Сумма"          , ОписаниеТипаЧисла15_2);
	ТаблицаЗакрытияСчета20.Колонки.Добавить("ПодразделениеДт", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ТаблицаЗакрытияСчета20.Колонки.Добавить("ПодразделениеКт", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ТаблицаЗакрытияСчета20.Колонки.Добавить("СубконтоКт1");
	ТаблицаЗакрытияСчета20.Колонки.Добавить("СубконтоКт2");
	ТаблицаЗакрытияСчета20.Колонки.Добавить("СубконтоДт1");
	ТаблицаЗакрытияСчета20.Колонки.Добавить("СубконтоДт2");
	
	Возврат ТаблицаЗакрытияСчета20;
	
КонецФункции

#КонецОбласти
